In [12]:
import pandas as pd
import json
import numpy as np

import re

from sqlalchemy import create_engine
import psycopg2

from config import db_password

In [13]:
movies_metadata = pd.read_csv('movies_metadata.csv', low_memory = False)
ratings = pd.read_csv('ratings.csv')

In [14]:
movies_metadata.head()

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92.0
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156.0,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.1,34.0
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911.0,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.7,173.0

In [15]:
ratings.head()

   userId  movieId  rating   timestamp
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556

In [16]:
movies_metadata.sample(n=5)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
18831,False,NaN,17000000,"[{'id': 28, 'name': 'Action'}, {'id': 9648, 'n...",NaN,54271,tt1307873,en,The Big Bang,A private detective is hired to find a missing...,...,2011-01-17,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The search for the ultimate missing person end...,The Big Bang,False,5.5,40.0
41915,False,NaN,0,"[{'id': 18, 'name': 'Drama'}]",NaN,44472,tt0388534,en,Wasp,Zoë is a single mother who lives with her four...,...,2003-01-01,0.0,26.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Wasp,False,7.1,20.0
1049,False,NaN,0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,12614,tt0084865,en,Victor/Victoria,A struggling female soprano finds work playing...,...,1982-04-25,28215453.0,132.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,The disguise surprise comedy of the year!,Victor/Victoria,False,6.9,89.0
25604,False,NaN,0,"[{'id': 80, 'name': 'Crime'}]",NaN,51416,tt0034707,en,Escape from Crime,An ex-con becomes a daredevil photojournalist.,...,1942-07-25,0.0,51.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,I loved a guy with a gun --,Escape from Crime,False,0.0,0.0
31493,False,NaN,0,[],NaN,156084,tt0961209,en,The Town That Was,Filmed over a period of five years in Centrali...,...,2007-09-07,0.0,71.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Home is where the fire is.,The Town That Was,False,6.8,3.0

In [19]:
rating_counts = ratings.groupby(['movieId','rating'], as_index=False).count() \
                .rename({'userId':'count'}, axis=1) \
                .pivot(index='movieId',columns='rating', values='count')

In [20]:
rating_counts.columns = ['rating_' + str(col) for col in rating_counts.columns]

In [25]:
movies_df = pd.merge(wiki_movies_df, movies_metadata, on='imdb_id', suffixes=['_wiki', '_kaggle'])

NameError: name 'wiki_movies_df' is not defined

In [21]:
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/movie_data"

In [22]:
engine = create_engine(db_string)

In [23]:
movies_df.to_sql(name='movies', con=engine)

NameError: name 'movies_df' is not defined